# Terminal & shell
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Editors
brew "neovim"

# Git tools
brew "gh"
brew "git-delta"
brew "git-spice"
brew "lazygit"

# Search & file tools
brew "bat"
brew "fd"
brew "ripgrep"

# Runtime managers
brew "fnm"
brew "pnpm"

# Other CLI tools
brew "railway"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "ghostty"
